{ "digest": "79fea5ef776c4b73fc622e9ee292850ee2f589bbbc8088ab135cb521f0b42306",
  "covenant": {
  "title": "Tally Definition",
  "author": "mychips.org",
  "source": "http://mychips.org/covenants/Tally_Definition.json",
  "version": 1,
  "language": "en",
  "released": "2017-03-01",
  "content": [
    {"p": [
      "Pledges of CHIPs are tracked means of a Tally.",
      "A Tally is an agreement between two willing Parties, by which the Parties document, and account for, a series of Pledges made between them.",
      "The Tally is normally stored digitally, in a computer, as a collection of covenants and Pledges.",
      "The Parties agree to the terms and conditions of the Tally by computing a standardized hash from the contents of the Tally, and encrypting that hash using their private key.",
      "If one Party is in possession of a valid, encrypted hash of the document, this is sufficient proof of the consent of the other Party to the agreement."
    ]},
    {"p": [
      "The Parties to a Tally are distinct with respect to their expected roles.",
      "And the Tally has two counterparts, a Stock, and a Foil, each held by one of the Parties.",
      "The Party assigned to hold the Foil is the Party expected to issue Pledges in the normal course of business transactions.",
      "Likewise, the Party expected to receive, or hold those pledges is defined to be the Stock Holder."
    ]},
    {"p": [
      "For example, if a regular customer establishes a Tally with a merchant, in order to use CHIPs, to buy products or services from that merchant, then the customer will hold the Foil and the merchant will hold the Stock.",
      "If an employer pays and employee with CHIPs, the employers will hold the Foil and the Employee will hold the Stock."
    ]},
    {"p": [
      "In spite of the distinct definition of the Foil Holder and the Stock Holder, individual Pledges may be made by either Party, to the other Party.",
      "When added together, the net value of all Pledges contained in the Tally, form a total value for the Tally.",
      "Unless that value is zero, it will result in a net indebtedness of one Party to the other."
    ]},
    {"p": [
      "At any given time, the Party indebted for the net value is referred to as the Net Issuer.",
      "At that same time, the other Party is referred to as the Net Holder."
    ]},
    {"p": [
      "Pledges from the Foil Holder to the Stock Holder will accrue as positive numbers in the Tally.",
      "Pledges from the Stock Holder to the Foil Holder will accrue as negative numbers."
    ]}
  ]
}}
